[
  {
    "Name": "Football",
    "ArabicName": "كرة القدم",
    "Description": "Football, also known as soccer, is one of the most popular sports worldwide, played by two teams of 11 players each. The objective of the game is to score goals by kicking the ball into the opposing team's net while following the rules set by the governing bodies. The game is played on a rectangular field with a goal at each end, and players use their feet, head, or other body parts (except hands and arms) to control and pass the ball. Goalkeepers are the only players allowed to use their hands within the penalty area. Football requires a combination of speed, agility, endurance, teamwork, and strategic thinking.Major competitions include the FIFA World Cup, UEFA Champions League, and domestic leagues such as the English Premier League and La Liga.",
    "DescriptionAr": "كرة القدم هي واحدة من أكثر الرياضات شعبية في العالم، تُلعب بين فريقين يتكون كل منهما من 11 لاعبًا. الهدف من اللعبة هو تسجيل الأهداف عن طريق ركل الكرة داخل مرمى الفريق المنافس مع الالتزام بالقواعد التي تضعها الهيئات المنظمة. تُلعب المباراة على ملعب مستطيل الشكل يحتوي على مرمى في كل طرف، ويُسمح للاعبين باستخدام أقدامهم ورؤوسهم وأجزاء أخرى من الجسم (باستثناء اليدين والذراعين) للتحكم في الكرة وتمريرها. حارس المرمى هو اللاعب الوحيد المسموح له باستخدام يديه داخل منطقة الجزاء. تتطلب كرة القدم مزيجًا من السرعة، والرشاقة، والقدرة على التحمل، والعمل الجماعي، والتفكير الاستراتيجي. من أبرز البطولات في كرة القدم كأس العالم FIFA، ودوري أبطال أوروبا UEFA، والدوريات المحلية مثل الدوري الإنجليزي الممتاز والدوري الإسباني.",
    "CategoryId": 100
  },
  {
    "Name": "Basketball",
    "ArabicName": "كرة السلة",
    "Description": "Basketball is a fast-paced team sport played between two teams of five players each. The objective is to score points by shooting the ball through the opposing team's hoop, which is mounted 10 feet (3.05 meters) high on a backboard. Players move the ball by dribbling or passing while following the game's rules, which include shot clocks, fouls, and out-of-bounds regulations. The team with the most points at the end of the game wins. Basketball requires speed, agility, endurance, teamwork, and precise shooting skills. It is played both indoors and outdoors, with professional leagues such as the NBA (National Basketball Association) and international tournaments like the FIBA Basketball World Cup and the Olympic Games being the most prestigious competitions.",
    "DescriptionAr": "كرة السلة هي رياضة جماعية سريعة الإيقاع تُلعب بين فريقين، يتكون كل فريق من خمسة لاعبين. الهدف من اللعبة هو تسجيل النقاط عن طريق رمي الكرة داخل سلة الفريق المنافس، والتي تكون مثبتة على لوحة خلفية على ارتفاع 10 أقدام (3.05 متر). يتحرك اللاعبون بالكرة من خلال المراوغة أو التمرير مع الالتزام بالقواعد، التي تشمل وقت التصويب، والأخطاء، وحدود الملعب. يفوز الفريق الذي يسجل أكبر عدد من النقاط في نهاية المباراة. تتطلب كرة السلة سرعة، ورشاقة، وقدرة على التحمل، والعمل الجماعي، ومهارات تصويب دقيقة. تُلعب اللعبة في ملاعب داخلية وخارجية، وتُعد دوري الـNBA (الرابطة الوطنية لكرة السلة) وكأس العالم لكرة السلة FIBA ودورة الألعاب الأولمبية من أبرز البطولات العالمية لهذه الرياضة.",
    "CategoryId": 100
  },
  {
    "Name": "Weightlifting",
    "ArabicName": "رفع الأثقال",
    "Description": "Weightlifting is a strength-based sport that involves lifting heavy weights in a controlled manner to test and develop muscular power. It is an Olympic sport consisting of two main lifts: the snatch, where the athlete lifts the barbell from the ground to overhead in one motion, and the clean and jerk, where the barbell is lifted to the shoulders first before being pushed overhead. Weightlifting requires a combination of strength, speed, technique, balance, and flexibility. Athletes compete in different weight categories, and the winner is determined by the highest combined total of both lifts. The sport is widely practiced for competitive purposes, fitness training, and strength development. Major competitions include the Olympic Games, World Weightlifting Championships, and regional championships.",
    "DescriptionAr": "رفع الأثقال هو رياضة تعتمد على القوة، حيث يقوم الرياضيون برفع أوزان ثقيلة بطريقة محكمة لاختبار وتطوير القوة العضلية. تُعد هذه الرياضة جزءًا من الألعاب الأولمبية وتتضمن نوعين أساسيين من الرفعات: الخطف، حيث يرفع اللاعب القضيب الحديدي من الأرض إلى أعلى الرأس بحركة واحدة، والنتر، حيث يرفع القضيب إلى مستوى الكتفين أولاً ثم يدفعه للأعلى فوق الرأس. تتطلب رياضة رفع الأثقال مزيجًا من القوة والسرعة والتقنية والتوازن والمرونة. يتنافس الرياضيون في فئات وزنية مختلفة، ويتم تحديد الفائز بناءً على أعلى مجموع لرفعتَي الخطف والنتر. تُمارس هذه الرياضة لأغراض تنافسية، ولتحسين اللياقة البدنية، وتطوير القوة العضلية. من أهم البطولات في هذه الرياضة الألعاب الأولمبية، وبطولة العالم لرفع الأثقال، والبطولات الإقليمية.",
    "CategoryId": 100
  },
  {
    "Name": "Karate",
    "ArabicName": "الكاراتيه",
    "Description": "Karate is a traditional Japanese martial art that focuses on striking techniques using punches, kicks, knee strikes, and open-hand techniques. It emphasizes discipline, self-defense, and physical fitness while also incorporating defensive blocking movements against attacks. Karate practitioners, known as karatekas, train in katas (pre-arranged forms) and kumite (sparring) to develop their skills. The sport is practiced worldwide for self-defense, personal development, and competitive purposes. Karate competitions are divided into kumite (combat) and kata (performance of techniques), and points are awarded based on precision, speed, and effectiveness. It is recognized as an Olympic sport and is governed by the World Karate Federation (WKF).",
    "DescriptionAr": "الكاراتيه هو فن قتالي ياباني تقليدي يركز على تقنيات الضرب باستخدام اللكمات والركلات وضربات الركبة وحركات اليد المفتوحة. تعتمد هذه الرياضة على الانضباط والدفاع عن النفس وتحسين اللياقة البدنية، كما تتضمن حركات دفاعية لصد الهجمات. يتدرب ممارسو الكاراتيه، المعروفون باسم الكاراتيكا، على الكاتا (حركات قتالية محددة مسبقًا) والكوميتيه (القتال) لتطوير مهاراتهم. تُمارس رياضة الكاراتيه على نطاق واسع للدفاع عن النفس والتطوير الشخصي والمنافسات الرياضية. تُقسم بطولات الكاراتيه إلى الكوميتيه (القتال) والكاتا (أداء الحركات)، ويتم منح النقاط بناءً على الدقة والسرعة والفعالية. تُعد الكاراتيه رياضة أولمبية وتخضع لإشراف الاتحاد العالمي للكاراتيه (WKF).",
    "CategoryId": 100
  },
  {
    "Name": "Taekwondo",
    "ArabicName": "التايكوندو",
    "Description": "Taekwondo is a Korean martial art that emphasizes fast, powerful kicks, spinning techniques, and high agility. It combines self-defense, discipline, and athletic performance, making it one of the most dynamic combat sports. Taekwondo practitioners, known as taekwondoin, train in poomsae (patterns), kyorugi (sparring), and breaking techniques to enhance their skills. Competitive taekwondo matches focus on scoring points through controlled kicks and punches, mainly targeting the torso and head. The sport is governed by the World Taekwondo (WT) organization and has been an official Olympic sport since the 2000 Sydney Games. Taekwondo requires flexibility, speed, precision, and mental discipline, making it both a self-defense system and a competitive sport practiced worldwide.",
    "DescriptionAr": "التايكوندو هو فن قتالي كوري يتميز بالركلات السريعة والقوية، والتقنيات الدوارة، والمرونة العالية. يجمع بين الدفاع عن النفس والانضباط والأداء الرياضي، مما يجعله واحدًا من أكثر الفنون القتالية ديناميكية. يتدرب ممارسو التايكوندو، المعروفون باسم التايكوندوين، على البومسيه (حركات قتالية محددة)، والكيروجي (القتال)، وتقنيات تكسير الألواح لتطوير مهاراتهم. تركز مباريات التايكوندو التنافسية على تسجيل النقاط من خلال الركلات واللكمات المحكمة، مع استهداف الجذع والرأس بشكل أساسي. تخضع هذه الرياضة لإشراف الاتحاد العالمي للتايكوندو (WT)، وأصبحت رياضة أولمبية رسمية منذ دورة سيدني عام 2000. يتطلب التايكوندو مرونة وسرعة ودقة وانضباطًا ذهنيًا، مما يجعله نظامًا للدفاع عن النفس ورياضة تنافسية تُمارس على نطاق واسع عالميًا.",
    "CategoryId": 100
  },
  {
    "Name": "Swimming",
    "ArabicName": "السباحة",
    "Description": "Swimming is a water-based sport and physical activity that involves propelling the body through water using coordinated arm and leg movements. It is both a recreational and competitive sport, with events ranging from short sprints to long-distance races. Competitive swimming includes different styles such as freestyle, backstroke, breaststroke, and butterfly, each requiring specific techniques and skills. The sport enhances cardiovascular fitness, muscle endurance, and overall flexibility. Swimming competitions are governed by the International Swimming Federation (World Aquatics) and feature in the Olympic Games, World Championships, and regional competitions. It is also a vital survival skill and is widely practiced for fitness, rehabilitation, and leisure.",
    "DescriptionAr": "السباحة هي رياضة مائية ونشاط بدني يتضمن تحريك الجسم عبر الماء باستخدام حركات منسقة للذراعين والساقين. تُمارس السباحة كرياضة ترفيهية وتنافسية، حيث تتنوع السباقات بين المسافات القصيرة والطويلة. تشمل السباحة التنافسية عدة أنماط، منها السباحة الحرة، والسباحة على الظهر، وسباحة الصدر، وسباحة الفراشة، ولكل منها تقنيات ومهارات محددة. تساعد السباحة في تحسين اللياقة القلبية والتنفسية، وزيادة قوة العضلات والمرونة العامة. تخضع البطولات الرسمية لإشراف الاتحاد الدولي للسباحة (World Aquatics)، وتُعد جزءًا من الألعاب الأولمبية وبطولات العالم والبطولات االإقليمية. كما تُعتبر السباحة مهارة إنقاذ أساسية، وتُمارس على نطاق واسع لأغراض اللياقة وإعادة التأهيل والترفيه.",
    "CategoryId": 200
  },
  {
    "Name": "Tennis",
    "ArabicName": "التنس",
    "Description": "Tennis is a fast-paced racket sport played on a rectangular court, where players use a racket to hit a ball over a net into the opponent’s side. It can be played in singles (one-on-one) or doubles (two-on-two) formats. The game is won by scoring points through rallies, with the goal of making the ball land within the opponent’s court while preventing them from returning it successfully. Tennis requires speed, agility, endurance, and strategic thinking, making it both physically and mentally demanding. Major tournaments include Wimbledon, the US Open, the French Open, and the Australian Open, collectively known as the Grand Slam. The sport is governed by the International Tennis Federation (ITF) and is popular worldwide for both professional competition and recreational play.",
    "DescriptionAr": "التنس هو رياضة مضرب سريعة الإيقاع تُلعب على ملعب مستطيل، حيث يستخدم اللاعبون المضرب لضرب الكرة فوق الشبكة إلى جانب الخصم. يمكن لعب التنس في فردي (لاعب ضد لاعب) أو زوجي (لاعبان ضد لاعبين). يتم الفوز بالمباراة من خلال تسجيل النقاط عبر التبادلات، حيث يكون الهدف هو جعل الكرة تهبط داخل ملعب الخصم مع منعه من إعادتها بنجاح. تتطلب هذه الرياضة السرعة، والرشاقة، والتحمل، والتفكير الاستراتيجي، مما يجعلها تحديًا بدنيًا وذهنيًا. تشمل أهم البطولات ويمبلدون، وبطولة أمريكا المفتوحة، وبطولة فرنسا المفتوحة، وبطولة أستراليا المفتوحة، والتي تُعرف مجتمعة باسم الجراند سلام. تخضع هذه الرياضة لإشراف الاتحاد الدولي للتنس (ITF)، وتُعتبر من أكثر الرياضات شعبية حول العالم سواء في المنافسات الاحترافية أو اللعب الترفيهي.",
    "CategoryId": 200
  },
  {
    "Name": "Judo",
    "ArabicName": "الجودو",
    "Description": "Judo is a modern Japanese martial art and Olympic sport that focuses on grappling techniques, throws, and ground control rather than striking. It was founded by Jigoro Kano in 1882 and emphasizes using an opponent’s strength and balance against them. Judo matches involve throws (nage-waza), pins, joint locks, and chokeholds (ne-waza) to subdue opponents. The sport promotes discipline, physical fitness, and mental resilience, making it both a self-defense system and a competitive sport. Judo competitions are governed by the International Judo Federation (IJF) and are featured in the Olympic Games, World Championships, and regional tournaments.",
    "DescriptionAr": "الجودو هو فن قتالي ياباني حديث ورياضة أولمبية تركز على تقنيات الاشتباك والرميات والتحكم الأرضي بدلاً من الضربات. أسسها جيغورو كانو عام 1882 وتعتمد على استغلال قوة وتوازن الخصم ضده. تشمل مباريات الجودو الرميات (ناجي-وازا)، والتثبيتات، ومفاصل التحكم، والخنق (ني-وازا) لإخضاع الخصم. تعزز هذه الرياضة الانضباط، واللياقة البدنية، والقدرة الذهنية، مما يجعلها نظامًا للدفاع عن النفس ورياضة تنافسية. تخضع بطولات الجودو لإشراف الاتحاد الدولي للجودو (IJF)، وتُدرج في الألعاب الأولمبية، وبطولات العالم، والبطولات الإقليمية.",
    "CategoryId": 200
  },
  {
    "Name": "Ballet",
    "ArabicName": "الباليه",
    "Description": "Ballet is a highly technical and artistic form of dance that combines grace, strength, flexibility, and precision. Originating in the Italian Renaissance and later refined in France and Russia, ballet is both a performing art and a physically demanding discipline. It involves fluid movements, jumps, spins, and complex footwork, often performed to classical music. Ballet dancers train for years to develop balance, coordination, and endurance. It is performed in classical, contemporary, and neoclassical styles and is a fundamental foundation for many other dance forms. Although primarily an artistic discipline, ballet requires the same level of athleticism as competitive sports.",
    "DescriptionAr": "الباليه هو شكل فني وتقني متقدم من الرقص يجمع بين الرشاقة، القوة، المرونة، والدقة. نشأ في عصر النهضة الإيطالية ثم تطور في فرنسا وروسيا، ويعتبر فنًا استعراضيًا وانضباطًا بدنيًا صارمًا. يعتمد الباليه على حركات سلسة، قفزات، دورانات، وخطوات معقدة، ويتم أداؤه غالبًا على أنغام الموسيقى الكلاسيكية. يتطلب التدريب على الباليه سنوات من العمل لاكتساب التوازن والتنسيق والتحمل. يُقدم الباليه في الأنماط الكلاسيكية والمعاصرة والنيوكلاسيكية، ويعد أساسًا مهمًا للعديد من أشكال الرقص الأخرى. وعلى الرغم من كونه فنًا استعراضيًا، إلا أنه يتطلب مستوى عالٍ من اللياقة البدنية مماثلًا للرياضات التنافسية.",
    "CategoryId": 200
  },
  {
    "Name": "Gymnastics",
    "ArabicName": "الجمباز",
    "Description": "Gymnastics is a highly dynamic and physically demanding sport that involves strength, flexibility, balance, coordination, and agility. It includes a variety of disciplines such as artistic gymnastics, rhythmic gymnastics, trampoline, and acrobatics. Gymnasts perform routines that incorporate jumps, flips, spins, and balances on apparatuses like the vault, balance beam, uneven bars, parallel bars, rings, and floor exercises. The sport requires years of training to master control, precision, and body awareness. Gymnastics is governed by the International Gymnastics Federation (FIG) and is a major event in the Olympic Games, World Championships, and other international competitions.",
    "DescriptionAr": "الجمباز هو رياضة ديناميكية تتطلب القوة، المرونة، التوازن، التنسيق، والرشاقة. يشمل عدة تخصصات مثل الجمباز الفني، الجمباز الإيقاعي، الترامبولين، والأكروبات. يؤدي لاعبو الجمباز حركات تتضمن القفزات، الدورات الهوائية، الدورانات، وحركات التوازن على أجهزة مثل جهاز القفز، عارضة التوازن، العقلة، المتوازيين، الحلق، وتمارين الأرضية. تتطلب هذه الرياضة سنوات من التدريب لاكتساب التحكم والدقة والوعي بالجسم. يشرف على الجمباز الاتحاد الدولي للجمباز (FIG)، وهو جزء أساسي من الألعاب الأولمبية، بطولات العالم، والبطولات الدولية الأخرى.",
    "CategoryId": 300
  },
  {
    "Name": "Ice Skating",
    "ArabicName": "التزلج على الجليد",
    "Description": "Ice skating is a sport and recreational activity that involves gliding across an ice surface using specially designed bladed skates. It includes various disciplines such as figure skating, speed skating, and ice hockey, each requiring different skills and techniques. Ice skating demands balance, agility, strength, and coordination, with athletes performing intricate movements, spins, jumps, and fast-paced maneuvers. The sport is popular worldwide, especially in colder regions, and is featured in the Winter Olympic Games. Competitive ice skating is governed by organizations such as the International Skating Union (ISU).",
    "DescriptionAr": "التزلج على الجليد هو رياضة ونشاط ترفيهي يعتمد على الانزلاق فوق سطح جليدي باستخدام أحذية ذات شفرات حادة. يشمل عدة أنواع مثل التزلج الفني، التزلج السريع، وهوكي الجليد، حيث يتطلب كل نوع مهارات وتقنيات مختلفة. يحتاج التزلج على الجليد إلى التوازن، الرشاقة، القوة، والتنسيق الحركي، ويؤدي الرياضيون حركات معقدة مثل الدورانات، القفزات، والمناورات السريعة. تُعد هذه الرياضة شائعة في جميع أنحاء العالم، خصوصًا في المناطق الباردة، وهي جزء أساسي من دورة الألعاب الأولمبية الشتوية. يخضع التزلج التنافسي لإشراف منظمات مثل الاتحاد الدولي للتزلج (ISU).",
    "CategoryId": 300
  },
  {
    "Name": "Handball",
    "ArabicName": "كرة اليد",
    "Description": "Handball is a fast-paced team sport played between two teams of seven players each, including a goalkeeper. The objective is to score goals by throwing a ball into the opponent's net using hand passes, dribbles, and quick movements. The game is played on a 40x20 meter court with a goal at each end. It requires speed, agility, teamwork, and strategic play. Handball is a popular international sport and is governed by the International Handball Federation (IHF). It is featured in the Olympic Games, World Championships, and regional tournaments.",
    "DescriptionAr": "كرة اليد هي رياضة جماعية سريعة الإيقاع تُلعب بين فريقين، يتكون كل منهما من سبعة لاعبين، بما في ذلك حارس المرمى. الهدف من اللعبة هو تسجيل الأهداف عبر رمي الكرة في مرمى الفريق المنافس باستخدام التمريرات اليدوية، المراوغة، والحركات السريعة. تُلعب المباراة على ملعب بأبعاد 40×20 مترًا مع وجود مرمى في كل طرف. تتطلب كرة اليد السرعة، الرشاقة، العمل الجماعي، والتخطيط الاستراتيجي. تعد هذه الرياضة من الألعاب المشهورة عالميًا، ويشرف عليها الاتحاد الدولي لكرة اليد (IHF)، كما أنها تُقام في الألعاب الأولمبية، بطولات العالم، والبطولات الإقليمية.",
    "CategoryId": 400
  },
  {
    "Name": "Squash",
    "ArabicName": "الإسكواش",
    "Description": "Squash is a high-intensity racket sport played by two (singles) or four (doubles) players in an enclosed court. The game involves hitting a small rubber ball against a front wall, aiming to make it difficult for the opponent to return the shot. Players must demonstrate speed, agility, endurance, and strategic thinking to control the pace and positioning of the game. Squash is played in a fast-paced manner, requiring quick reflexes and excellent hand-eye coordination. It is governed by the Professional Squash Association (PSA) and is played in international tournaments, including the World Squash Championships and the Commonwealth Games.",
    "DescriptionAr": "الإسكواش هو رياضة مضرب عالية الكثافة تُلعب بين لاعبين (فردي) أو أربعة لاعبين (زوجي) داخل ملعب مغلق. تعتمد اللعبة على ضرب كرة مطاطية صغيرة على الحائط الأمامي بحيث يصعب على الخصم إرجاعها. تتطلب هذه الرياضة السرعة، الرشاقة، التحمل، والتفكير الاستراتيجي للتحكم في وتيرة اللعب وتمركز اللاعبين داخل الملعب. يتميز الإسكواش بالإيقاع السريع، مما يستلزم ردود فعل سريعة وتنسيقًا دقيقًا بين العين واليد. تُنظم بطولاته تحت إشراف رابطة الإسكواش للمحترفين (PSA)، وهو رياضة تنافسية تُمارس في البطولات الدولية مثل بطولة العالم للإسكواش ودورة ألعاب الكومنولث.",
    "CategoryId": 400
  },
  {
    "Name": "Volleyball",
    "ArabicName": "كرة الطائرة",
    "Description": "Volleyball is a fast-paced team sport played between two teams of six players each. The objective is to hit the ball over the net and land it in the opponent’s court while preventing them from doing the same. Players use passing, setting, spiking, and blocking techniques to score points. The game requires speed, agility, teamwork, and coordination. Volleyball is played both indoors and on the beach (beach volleyball) and is governed by the Fédération Internationale de Volleyball (FIVB). It is a major sport in the Olympic Games, World Championships, and international leagues.",
    "DescriptionAr": ";كرة الطائرة هي رياضة جماعية سريعة تُلعب بين فريقين، يتكون كل منهما من ستة لاعبين. يهدف كل فريق إلى تمرير الكرة فوق الشبكة وإسقاطها في ملعب الخصم، مع محاولة منع الفريق الآخر من تحقيق ذلك. يستخدم اللاعبون التمرير، الإعداد، الضرب الساحق، وحائط الصد لكسب النقاط. تتطلب اللعبة السرعة، الرشاقة، العمل الجماعي، والتنسيق. تُلعب الكرة الطائرة في الصالات المغلقة وعلى الشواطئ (كرة الطائرة الشاطئية)، ويشرف عليها الاتحاد الدولي للكرة الطائرة (FIVB). وهي من الرياضات الأساسية في الألعاب الأولمبية، بطولات العالم، والدوريات الدولية",
    "CategoryId": 400
  },
  {
    "Name": "Athletics",
    "ArabicName": "ألعاب القوى",
    "Description": "Athletics is a collection of competitive sports that include running, jumping, throwing, and walking events. It is one of the oldest and most fundamental forms of sport, emphasizing speed, endurance, strength, and skill. Key disciplines in athletics include sprint races, long-distance running, hurdles, high jump, long jump, shot put, javelin throw, and race walking. Athletics is governed by World Athletics and is a core sport in the Olympic Games, World Championships, and regional competitions. It is widely practiced at professional, amateur, and school levels worldwide.",
    "DescriptionAr": "لعاب القوى هي مجموعة من الرياضات التنافسية التي تشمل الجري، القفز، الرمي، والمشي. تُعد من أقدم وأهم أنواع الرياضات، حيث تركز على السرعة، القدرة على التحمل، القوة، والمهارة. تشمل أبرز مسابقات ألعاب القوى سباقات السرعة، الجري لمسافات طويلة، سباقات الحواجز، الوثب العالي، الوثب الطويل، دفع الجلة، رمي الرمح، وسباق المشي. تخضع ألعاب القوى لإشراف الاتحاد الدولي لألعاب القوى (World Athletics)، وهي رياضة أساسية في الألعاب الأولمبية، بطولات العالم، والمسابقات الإقليمية، كما تُمارس على المستويات الاحترافية والهواة والمدارس في جميع أنحاء العالم.",
    "CategoryId": 400
  }
]